Repository: MightyCreak/diffuse
Catalog: po/*.po
Languages: pt_br

source: Diffuse
pt_br: Comparador de Arquivos Diffuse

source: Graphical tool for merging and comparing text files
pt_br: O ‘Diffuse’ é uma ferramenta por interface gráfica que permite comparar e mesclar os arquivos de texto, comparar uma quantidade arbitrária de arquivos lado a lado e oferece aos usuários a capacidade de ajustar manualmente a correspondência das linhas e editar os arquivos diretamente, possibilita recuperar as revisões feitas com as ferramentas ‘Bazaar’, ‘CVS’, ‘Darcs’, ‘Git’, ‘Mercurial’, ‘Monotone’, ‘RCS’, ‘Subversion’ e ‘SVK’

source: Diffuse is a graphical tool for comparing and merging text files. It can retrieve files for comparison from Bazaar, CVS, Darcs, Git, Mercurial, Monotone, RCS, and Subversion repositories.
pt_br: O ‘Diffuse’ é uma ferramenta por interface gráfica que permite comparar e mesclar os arquivos de texto, comparar uma quantidade arbitrária de arquivos lado a lado e oferece aos usuários a capacidade de ajustar manualmente a correspondência das linhas e editar os arquivos diretamente, possibilita recuperar as revisões feitas com as ferramentas ‘Bazaar’, ‘CVS’, ‘Darcs’, ‘Git’, ‘Mercurial’, ‘Monotone’, ‘RCS’, ‘Subversion’ e ‘SVK’.

source: Main window
pt_br: Janela principal

source: About window
pt_br: Sobre esta janela

source: Copyright
pt_br: Direitos autorais

source: _Cancel
pt_br: _Cancelar

source: Encoding:
pt_br: Codificação:

source: Revision:
pt_br: Revisão:

source: Find...
pt_br: Encontrar...

source: Search For:
pt_br: Procurar por:

source: Match Case
pt_br: Corresponder por maiúsculas

source: Search Backwards
pt_br: Procurar para trás

source: Display version and copyright information
pt_br: Exibir as informações sobre a versão e sobre os direitos autorais

source: Do not read any resource files
pt_br: Não ler os arquivos de recursos

source: Specify explicit resource file
pt_br: Definir um arquivo de recursos específico

source: File revisions <rev-1> and <rev>
pt_br: Revisões dos arquivos <rev-1> e <rev>

source: Close all tabs with no differences
pt_br: Fechar todas as abas sem diferenças

source: Use <codec> to read and write files
pt_br: Utilizar o codificador/descodificador <codec> para ler e escrever os arquivos

source: Display <label> instead of the file name
pt_br: Exibir a etiqueta <label> em vez dos nomes dos arquivos

source: Create a new tab for each modified file
pt_br: Criar uma nova aba para cada arquivo que foi modificado

source: File revision <rev>
pt_br: Revisão do arquivo <rev>

source: Create a new tab for each file
pt_br: Criar uma nova aba para cada arquivo

source: Start a new tab
pt_br: Iniciar uma nova aba

source: Version control system search order
pt_br: Ordem da pesquisa do sistema do controle da versão

source: Start with line <line> selected
pt_br: Iniciar com a linha <linhe> selecionada

source: Create a blank file comparison pane
pt_br: Criar um novo painel de comparação em branco

source: Ignore changes to white space
pt_br: Ignorar as alterações nos espaços em branco

source: Ignore changes in blank lines
pt_br: Ignorar as alterações nas linhas em branco

source: Ignore end of line differences
pt_br: Ignorar as diferenças do fim da linha

source: Ignore case differences
pt_br: Ignorar as diferenças entre as letras maiúsculas e minúsculas

source: Ignore white space differences
pt_br: Ignorar as diferenças dos espaços em branco

source: Diffuse is a graphical tool for merging and comparing text files. Diffuse is able to compare an arbitrary number of files side-by-side and gives users the ability to manually adjust line matching and directly edit files. Diffuse can also retrieve revisions of files from several VCSs for comparison and merging.
pt_br: O ‘Diffuse’ é uma ferramenta por interface gráfica que permite comparar e mesclar os arquivos de texto, comparar uma quantidade arbitrária de arquivos lado a lado e oferece aos usuários a capacidade de ajustar manualmente a correspondência das linhas e editar os arquivos diretamente, possibilita recuperar as revisões feitas com as ferramentas ‘Bazaar’, ‘CVS’, ‘Darcs’, ‘Git’, ‘Mercurial’, ‘Monotone’, ‘RCS’, ‘Subversion’ e ‘SVK’.

source: Error reading %s.
pt_br: Ocorreu um erro ao ler %s.

source: Error parsing line number.
pt_br: Ocorreu um erro ao analisar o número da linha.

source: Error processing argument "%s". Directory not expected.
pt_br: Ocorreu um erro ao processar o argumento "%s". A pasta não era esperada.

source: Display
pt_br: Exibir

source: Font
pt_br: Letra

source: Tab width
pt_br: Largura da tabulação

source: Show right margin
pt_br: Exibir a margem direita

source: Right margin
pt_br: Margem direita

source: Show line numbers
pt_br: Exibir os números da linha

source: Show white space characters
pt_br: Exibir os espaços em branco

source: Ignore blank line differences
pt_br: Ignorar as diferenças das linhas em branco

source: Alignment
pt_br: Alinhamento

source: Ignore case
pt_br: Ignorar as letras maiúsculas

source: Ignore white space
pt_br: Ignorar os espaços em branco

source: Ignore blank lines
pt_br: Ignorar as linhas em branco

source: Ignore end of line characters
pt_br: Ignorar os caracteres do fim da linha

source: Auto indent
pt_br: Indentação automática

source: Expand tabs to spaces
pt_br: Expandir as tabulações para os espaços

source: Soft tab width
pt_br: Largura suave da tabulação

source: Tabs
pt_br: Abas

source: Default panes
pt_br: Painéis padrão

source: Always show the tab bar
pt_br: Sempre exibir a barra das abas

source: Warn me when closing a tab will quit %s
pt_br: Avisar quando o fechamento da aba resultará em fechar do %s

source: Regional Settings
pt_br: Definições regionais

source: Default codec
pt_br: Codificação padrão

source: Order of codecs used to identify encoding
pt_br: Ordem dos codecs utilizados para identificar a codificação

source: Cygwin
pt_br: Coleção de ferramentas Cygwin

source: Root directory
pt_br: Pasta do root

source: Cygdrive prefix
pt_br: Prefixo do Cygdrive

source: "co" command
pt_br: Comando "co"

source: "rlog" command
pt_br: Comando "rlog"

source: Command
pt_br: Comando

source: Launch from a Bash login shell
pt_br: Iniciar em um console com a sessão do Bash

source: Update paths for Cygwin
pt_br: Atualizar os caminhos para o Cygwin

source: Version Control
pt_br: Controle das versões

source: Preferences
pt_br: Preferências

source: Error writing %s.
pt_br: Ocorreu um erro ao salvar o %s.

source: _Open
pt_br: _Abrir

source: The key binding "{key}" is invalid
pt_br: A tecla de atalho "{key}" não é conhecida

source: Imports must have one argument
pt_br: As importações devem ter um argumento

source: Key bindings must have three arguments
pt_br: As combinações das teclas de atalho devem ter três argumentos

source: Colors must have four arguments
pt_br: As cores devem ter quatro argumentos

source: Floats must have two arguments
pt_br: Os flutuadores (floats) devem ter dois argumentos

source: Options must have two arguments
pt_br: As opções devem ter dois argumentos

source: Option "{option}" is unknown
pt_br: A opção "{option}" não é conhecida

source: Strings must have two arguments
pt_br: As sequências de caracteres devem ter dois argumentos

source: Syntaxes must have two or three arguments
pt_br: As sintaxes devem ter dois ou três argumentos

source: Syntax patterns must have at least four arguments
pt_br: Os modelos das sintaxes devem ter pelo menos quatro argumentos

source: Value "{value}" is unknown
pt_br: O valor "{value}" não é conhecido

source: Syntax files must have one or two arguments
pt_br: Os arquivos das sintaxes devem ter um ou dois argumentos

source: Syntax magics must have at least one argument
pt_br: As sintaxes devem ter pelo menos um argumento

source: Keyword "{keyword}" is unknown
pt_br: A palavra-chave "{keyword}" não é conhecida

source: Auto Detect
pt_br: Detecção automática

source: Error parsing revision %s.
pt_br: Ocorreu um erro ao analisar a revisão %s.

source: Align with Selection
pt_br: Alinhar com a seleção

source: Isolate
pt_br: Isolar

source: Merge Selection
pt_br: Mesclar a seleção

source: Cut
pt_br: Cortar

source: Copy
pt_br: Copiar

source: Paste
pt_br: Colar

source: Select All
pt_br: Selecionar tudo

source: Clear Edits
pt_br: Limpar as edições

source: Swap with Selected Pane
pt_br: Trocar com o painel selecionado

source: Close Tab
pt_br: Fechar a aba

source: Open File...
pt_br: Abrir o arquivo...

source: Reload File
pt_br: Recarregar o arquivo

source: Save File
pt_br: Salvar o arquivo

source: Save File As...
pt_br: Salvar o arquivo como...

source: Column %d
pt_br: Coluna %d

source: Save changes before loading the new file?
pt_br: Salvar as alterações antes de carregar o novo arquivo?

source: _No
pt_br: _Não

source: _Yes
pt_br: _Sim

source: Error reading revision %(rev)s of %(file)s.
pt_br: Ocorreu um erro ao ler a revisão %(rev)s do arquivo %(file)s.

source: Open File
pt_br: Abrir o arquivo

source: Save %(title)s Pane %(pane)d
pt_br: Salvar o %(title)s no painel %(pane)d

source: A file named %s already exists. Do you want to overwrite it?
pt_br: Já existe um arquivo chamado %s. Você quer substituí-lo?

source: The file %s has been modified by another process since reading it. If you save, all the external changes could be lost. Save anyways?
pt_br: O arquivo %s foi modificado por meido de um outro processo desde a última vez que foi lido. Se você salvar agora, todas as alterações externas poderão ser perdidas. Você quer salvar mesmo assim?

source: Error encoding to %s.
pt_br: Ocorreu um erro ao codificar para %s.

source: Go To Line...
pt_br: Ir para a linha...

source: Line Number:
pt_br: Número da linha:

source: Press the enter key or double click to edit. Press the space bar or use the RMB menu to manually align.
pt_br: Pressione a tecla ‘Enter’ ou clique duas vezes para editar. Ou pressione a tecla de espaço ou utilize o menu ‘RMB’ para alinhar manualmente.

source: Press the escape key to finish editing.
pt_br: Pressione a tecla ‘Esc’ para terminar a edição.

source: Select target line and press the space bar to align. Press the escape key to cancel.
pt_br: Selecione a linha que será o alvo e pressione a tecla de espaço para alinhar. Ou pressione tecla ‘Esc’ para cancelar.

source: _File
pt_br: _Arquivo

source: _Open File...
pt_br: Abrir o arquiv_o...

source: Open File In New _Tab...
pt_br: Abrir o arquivo em no_va aba...

source: Open _Modified Files...
pt_br: Abrir os arquivos _modificados...

source: Open Commi_t...
pt_br: Abrir a rev_isão...

source: _Reload File
pt_br: _Recarregar o arquivo

source: _Save File
pt_br: _Salvar o arquivo

source: Save File _As...
pt_br: Salvar o _arquivo como...

source: Save A_ll
pt_br: Sa_lvar o tudo

source: New _2-Way File Merge
pt_br: Nova mesclagem de _2 arquivos

source: New _3-Way File Merge
pt_br: Nova mesclagem de _3 arquivos

source: New _N-Way File Merge...
pt_br: Nova mesclagem de _N vias...

source: _Close Tab
pt_br: Fe_char a aba

source: _Undo Close Tab
pt_br: Desfa_zer o fechamento da aba

source: _Quit
pt_br: _Sair

source: _Edit
pt_br: _Editar

source: _Undo
pt_br: _Desfazer

source: _Redo
pt_br: _Refazer

source: Cu_t
pt_br: Cor_tar

source: _Copy
pt_br: _Copiar

source: _Paste
pt_br: Co_lar

source: Select _All
pt_br: Selecion_ar tudo

source: C_lear Edits
pt_br: _Limpar as edições

source: _Dismiss All Edits
pt_br: _Descartar todas as edições

source: _Find...
pt_br: _Encontrar...

source: Find _Next
pt_br: Encontrar o segui_nte

source: Find Pre_vious
pt_br: Encontrar o _anterior

source: _Go To Line...
pt_br: _Ir para a linha...

source: Pr_eferences...
pt_br: Pr_eferências...

source: None
pt_br: Nenhuma

source: _View
pt_br: _Visualizar

source: _Syntax Highlighting
pt_br: Destacar a _sintaxe

source: Re_align All
pt_br: Re_alinhar tudo

source: _Isolate
pt_br: _Isolar

source: _First Difference
pt_br: _Primeira diferença

source: _Previous Difference
pt_br: Diferença _anterior

source: _Next Difference
pt_br: Diferença segui_nte

source: _Last Difference
pt_br: Ú_ltima diferença

source: Fir_st Tab
pt_br: P_rimeira aba

source: Pre_vious Tab
pt_br: _Aba anterior

source: Next _Tab
pt_br: Aba seguin_te

source: Las_t Tab
pt_br: Úl_tima aba

source: Shift Pane _Right
pt_br: Mover o painel para a di_reita

source: Shift Pane _Left
pt_br: Mover o painel para a es_querda

source: F_ormat
pt_br: F_ormatar

source: Convert To _Upper Case
pt_br: Converter para letras maiúsc_ulas

source: Convert To _Lower Case
pt_br: Converter para letras minúscu_las

source: Sort Lines In _Ascending Order
pt_br: Organizar as linhas em ordem _crescente

source: Sort Lines In D_escending Order
pt_br: Organizar as linhas em ordem _decrescente

source: Remove Trailing _White Space
pt_br: Remover os _espaços em branco à direita

source: Convert Tabs To _Spaces
pt_br: Converter as tabulações em e_spaços

source: Convert Leading Spaces To _Tabs
pt_br: Converter os espaços iniciais em _tabulações

source: _Increase Indenting
pt_br: Au_mentar o recuo

source: De_crease Indenting
pt_br: Di_minuir o recuo

source: Convert To _DOS Format
pt_br: Converter para o formato do _DOS

source: Convert To _Mac Format
pt_br: Converter para o formato do _Mac

source: Convert To Uni_x Format
pt_br: Converter para o formato do Uni_x

source: _Merge
pt_br: _Mesclar

source: Copy Selection _Right
pt_br: Copiar a seleção à di_reita

source: Copy Selection _Left
pt_br: Copiar a seleção à es_querda

source: Copy Left _Into Selection
pt_br: Cop_iar da esquerda para a seleção

source: Copy Right I_nto Selection
pt_br: Copiar da _direita para a seleção

source: _Merge From Left Then Right
pt_br: _Mesclar da esquerda e depois da direita

source: M_erge From Right Then Left
pt_br: M_esclar da direita e depois da esquerda

source: _Help
pt_br: A_juda

source: _Help Contents...
pt_br: Conteúdo da a_juda...

source: _About %s...
pt_br: _Sobre o %s...

source: New 2-Way File Merge
pt_br: Nova mesclagem de _2 vias

source: New 3-Way File Merge
pt_br: Nova mesclagem de _3 vias

source: Realign All
pt_br: Realinhar tudo

source: First Difference
pt_br: Primeira diferença

source: Previous Difference
pt_br: Diferença anterior

source: Next Difference
pt_br: Diferença seguinte

source: Last Difference
pt_br: Última diferença

source: Copy Selection Right
pt_br: Copiar a seleção à direita

source: Copy Selection Left
pt_br: Copiar a seleção à esquerda

source: Copy Left Into Selection
pt_br: Copiar da esquerda para a seleção

source: Copy Right Into Selection
pt_br: Copiar da direita para a seleção

source: Merge From Left Then Right
pt_br: Mesclar da esquerda e depois da direita

source: Merge From Right Then Left
pt_br: Mesclar da direita e depois da esquerda

source: Undo
pt_br: Desfazer

source: Redo
pt_br: Refazer

source: Changes detected
pt_br: Alterações detectadas

source: Some files have unsaved changes. Select the files to save before closing.
pt_br: Alguns arquivos possuem alterações que não foram salvas. Salve os arquivos antes de fechar.

source: Tab
pt_br: Aba

source: Pane
pt_br: Painel

source: Close _Without Saving
pt_br: Fechar sem sal_var os arquivos

source: Closing this tab will quit %s.
pt_br: Se você fechar esta aba resultará em fechar o arquivo %s.

source: File Merge %d
pt_br: Mesclagem dos arquivos %d

source: Error retrieving commits for %s.
pt_br: Ocorreu um erro ao obter as revisões do %s.

source: Error retrieving modifications for %s.
pt_br: Ocorreu um erro ao obter as modificações do %s.

source: Open File In New Tab
pt_br: Abrir o arquivo em uma nova aba

source: Choose Folder With Modified Files
pt_br: Escolha a pasta com arquivos que estão modificados

source: No modified files found.
pt_br: Não foi encontrado nenhum arquivo modificado.

source: Choose Folder With Commit
pt_br: Escolha a pasta com revisão

source: No committed files found.
pt_br: Não foi encontrado nenhum arquivo revisado.

source: New N-Way File Merge...
pt_br: Nova mesclagem de N vias...

source: Number of panes:
pt_br: Número de painéis:

source: Phrase not found. Continue from the end of the file?
pt_br: A frase não foi encontrada. Você quer continuar a partir do final do arquivo?

source: Phrase not found. Continue from the start of the file?
pt_br: A frase não foi encontrada. Você quer continuar a partir do início do arquivo?

source: Diffuse is a graphical tool for merging and comparing text files.
pt_br: O ‘Diffuse’ é uma ferramenta por interface gráfica que permite comparar e mesclar os arquivos de texto.

source: translator-credits
pt_br: Tradutores voluntários do idioma português do Brasil (pt_BR): Pedro Albuquerque <pmra@gmx.com>, 2018, 2022. marcelocripe <marcelocripe@gmail.com>, 2024.
